console.log ( 
Part - 1
Score 100/100
console.log ( Score 100/100 
   Main 
   [×] - верстка валидная +4
   [×] - логотип в хедере состоит из текстовых элементов +1
   [×] - страница содержит ровно один элемент +1
   [×] - добавлен favicon +1
   [×] - блок <header> +5
   [×] - блок Not only +5
   [×] - блок About +5
   [×] - блок Our Friends +5
   [×] - блок Help +5
   [×] - блок In addition +5
   [×] - блок <footer> +5
   [×] - блок Help с сеточной версткой flex +2
   [×] - при масштабе верстка по центру +2
   [×] - фоновый цвет тянется по ширине +2
   [×] - элемент About the Shelter в навигации подсвечен и неинтерактивен +2
   [×] - карточка с питомцем Our Friends интерактивна +2
   [×] - лавная прокрутка по якорям +2
   [×] - выполняются все ссылочные связи +2
   [×] - выполнена интерактивность ссылок и кнопок +2
   [×] - плавное изменение внешнего вида элемента +2
   = 60/60

   Pets
   [×] - верстка валидная +4
   [×] - логотип в хедере состоит из текстовых элементов +1
   [×] - страница содержит ровно один элемент +1
   [×] - добавлен favicon +1
   [×] - блок <header> +5
   [×] - блок Our Friends +5
   [×] - блок <footer> +5
   [×] - при масштабе верстка по центру +2
   [×] - фоновый цвет тянется по ширине +2
   [×] - элемент Our pets в навигации подсвечен и неинтерактивен +2
   [×] - доступные кнопки пагинации (вправо) активны, недоступные (влево) - неактивны (disabled) +2
   [×] - каждая карточка с питомцем в блоке Our Friends интерактивна при 
         наведении на любую область этой карточки +2
   [×] - плавная прокрутка по якорям +2
   [×] - выполняются все ссылочные связи согласно Перечню ссылочных связей +2
   [×] - выполнена интерактивность ссылок и кнопок +2
   [×] - плавное изменение внешнего вида элемента +2
   = 40/ 40

Part - 2
Score 96/100
   [×] - Вёрстка страницы 'Main' соответствует макету при ширине экрана 1280px +14
   [×] - Вёрстка страницы 'Main' соответствует макету при ширине экрана 768px +14
   [×] - Вёрстка страницы 'Main' соответствует макету при ширине экрана 320px +14

   [×] - Вёрстка страницы 'Pets' соответствует макету при ширине экрана 1280px +6
   [×] - Вёрстка страницы 'Pets' соответствует макету при ширине экрана 768px +6
   [×] - Вёрстка страницы 'Pets' соответствует макету при ширине экрана 320px +6

   [×] - Ни на одном из разрешений до 320px включительно не появляется горизонтальная полоса прокрутки, справа от отдельных блоков не появляются белые поля. Весь контент страницы при этом сохраняется: не обрезается и не удаляется: +20

   [×] -  Верстка резиновая +4/8

   [×] - При ширине экрана меньше 768px на обеих страницах меню в хедере скрывается, появляется иконка бургер-меню +4

   [×] - Верстка обеих страниц валидная +8
)
