console.log ( Score 100/100
   Main 
   [×] - верстка валидная +4
   [×] - логотип в хедере состоит из текстовых элементов +1
   [×] - страница содержит ровно один элемент +1
   [×] - добавлен favicon +1
   [×] - блок <header> +5
   [×] - блок Not only +5
   [×] - блок About +5
   [×] - блок Our Friends +5
   [×] - блок Help +5
   [×] - блок In addition +5
   [×] - блок <footer> +5
   [×] - блок Help с сеточной версткой flex +2
   [×] - при масштабе верстка по центру +2
   [×] - фоновый цвет тянется по ширине +2
   [×] - элемент About the Shelter в навигации подсвечен и неинтерактивен +2
   [×] - карточка с питомцем Our Friends интерактивна +2
   [×] - лавная прокрутка по якорям +2
   [×] - выполняются все ссылочные связи +2
   [×] - выполнена интерактивность ссылок и кнопок +2
   [×] - плавное изменение внешнего вида элемента +2
   = 60/60

   Pets
   [×] - верстка валидная +4
   [×] - логотип в хедере состоит из текстовых элементов +1
   [×] - страница содержит ровно один элемент +1
   [×] - добавлен favicon +1
   [×] - блок <header> +5
   [×] - блок Our Friends +5
   [×] - блок <footer> +5
   [×] - при масштабе верстка по центру +2
   [×] - фоновый цвет тянется по ширине +2
   [×] - элемент Our pets в навигации подсвечен и неинтерактивен +2
   [×] - доступные кнопки пагинации (вправо) активны, недоступные (влево) - неактивны (disabled) +2
   [×] - каждая карточка с питомцем в блоке Our Friends интерактивна при 
         наведении на любую область этой карточки +2
   [×] - плавная прокрутка по якорям +2
   [×] - выполняются все ссылочные связи согласно Перечню ссылочных связей +2
   [×] - выполнена интерактивность ссылок и кнопок +2
   [×] - плавное изменение внешнего вида элемента +2
   = 40/ 40
)